In [ ]:
import pandas as pd
import numpy as np

In [ ]:
ser = pd.Series([23,43,63,61,56])

In [ ]:
ser

0    23
1    43
2    63
3    61
4    56
dtype: int64

In [ ]:
t = (87,67,45)
ser1 = pd.Series(t)

In [ ]:
ser1

0    87
1    67
2    45
dtype: int64

In [ ]:
arr = np.array([34,21,98,45])
ser2 = pd.Series(arr)

In [ ]:
ser2

0    34
1    21
2    98
3    45
dtype: int32

In [ ]:
dict1 = {'a':23,'b':76,'c':34}

In [ ]:
ser3 = pd.Series(dict1)

In [ ]:
ser3

a    23
b    76
c    34
dtype: int64

In [ ]:
a = [44,55,66]
ser4 = pd.Series(a, index=['apple','banana','cucumber'])
ser4

apple       44
banana      55
cucumber    66
dtype: int64

In [ ]:
type(ser4)

pandas.core.series.Series

In [ ]:
ser4.dtype

dtype('int64')

## DataFrame

In [ ]:
list2 = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(list2)

In [ ]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
list3 = [[34,23,12,4],[23,54,56,34],[66,87,12,54]]
df1 = pd.DataFrame(list3,columns=['alex','bob','john','marisa'])
df1

   alex  bob  john  marisa
0    34   23    12       4
1    23   54    56      34
2    66   87    12      54

In [ ]:
dict2 = {'patna':[1,2,3,4,5],'Mohali':[23,45,32,12,43],'Dhanbad':[56,32,12,87,34]}

In [ ]:
df2 = pd.DataFrame(dict2)

In [ ]:
df2

   patna  Mohali  Dhanbad
0      1      23       56
1      2      45       32
2      3      32       12
3      4      12       87
4      5      43       34

In [ ]:
df3 = pd.DataFrame(dict2,index=['a','b','c','d','a'])
df3

   patna  Mohali  Dhanbad
a      1      23       56
b      2      45       32
c      3      32       12
d      4      12       87
a      5      43       34

In [ ]:
df4 = pd.DataFrame({'name':['Alex','Bob','John'],'age':[32,18,25]})
df4

   name  age
0  Alex   32
1   Bob   18
2  John   25

In [ ]:
df3.rename({'patna':'Delhi'},axis=1,inplace=True)

In [ ]:
df3

   Delhi  Mohali  Dhanbad
a      1      23       56
b      2      45       32
c      3      32       12
d      4      12       87
a      5      43       34

In [ ]:
df3['Mohali']

a    23
b    45
c    32
d    12
a    43
Name: Mohali, dtype: int64

In [ ]:
df3.Mohali

a    23
b    45
c    32
d    12
a    43
Name: Mohali, dtype: int64

In [ ]:
df3.rename({'Dhanbad':'port blair'},axis=1,inplace=True)

In [ ]:
df3

   Delhi  Mohali  port blair
a      1      23          56
b      2      45          32
c      3      32          12
d      4      12          87
a      5      43          34

In [ ]:
df3['port blair']

a    56
b    32
c    12
d    87
a    34
Name: port blair, dtype: int64

In [ ]:
df3.port blair

SyntaxError: invalid syntax (660417864.py, line 1)

In [ ]:
df3

   Delhi  Mohali  port blair
a      1      23          56
b      2      45          32
c      3      32          12
d      4      12          87
a      5      43          34

In [ ]:
df3[['Mohali','port blair']]

   Mohali  port blair
a      23          56
b      45          32
c      32          12
d      12          87
a      43          34

In [ ]:
df3['Mohali']

a    23
b    45
c    32
d    12
a    43
Name: Mohali, dtype: int64

In [ ]:
type(df3)

pandas.core.frame.DataFrame

In [ ]:
type(df3['port blair'])

pandas.core.series.Series

In [ ]:
dict4 = {'Brand':['BMW','AUDI','MERC','MERC','BMW','SUZUKI','HYUNDAI','HYUNDAI','TOYOTA'],
        'Model':['320 d','A4','C class','G Wagon','730 i','Celerio','Verna','Venue','Crysta'],
        'hp':[230,324,123,365,237,127,300,211,654],
        'mileage':[5,6,6,4,5,25,20,18,10],
        'price':['50 lakhs','48 lakhs','52 lakhs','2 crores','1.4 crores','6.5 lakhs','15 lakhs','16 lakhs','32 lakhs']}

In [ ]:
df4 = pd.DataFrame(dict4)

In [ ]:
df4

     Brand    Model   hp  mileage       price
0      BMW    320 d  230        5    50 lakhs
1     AUDI       A4  324        6    48 lakhs
2     MERC  C class  123        6    52 lakhs
3     MERC  G Wagon  365        4    2 crores
4      BMW    730 i  237        5  1.4 crores
5   SUZUKI  Celerio  127       25   6.5 lakhs
6  HYUNDAI    Verna  300       20    15 lakhs
7  HYUNDAI    Venue  211       18    16 lakhs
8   TOYOTA   Crysta  654       10    32 lakhs

## Loc and iloc

In [ ]:
df4.loc[1:2,['Model','hp','mileage']]

     Model   hp  mileage
1       A4  324        6
2  C class  123        6

In [ ]:
df4.loc[1:2,'Model':'mileage']

     Model   hp  mileage
1       A4  324        6
2  C class  123        6

In [ ]:
df4[['Model','hp']]

     Model   hp
0    320 d  230
1       A4  324
2  C class  123
3  G Wagon  365
4    730 i  237
5  Celerio  127
6    Verna  300
7    Venue  211
8   Crysta  654

In [ ]:
df4.loc[ : , ['Model','hp']  ]

     Model   hp
0    320 d  230
1       A4  324
2  C class  123
3  G Wagon  365
4    730 i  237
5  Celerio  127
6    Verna  300
7    Venue  211
8   Crysta  654

In [ ]:
df4.loc[5]

Brand         SUZUKI
Model        Celerio
hp               127
mileage           25
price      6.5 lakhs
Name: 5, dtype: object

In [ ]:
df4

     Brand    Model   hp  mileage       price
0      BMW    320 d  230        5    50 lakhs
1     AUDI       A4  324        6    48 lakhs
2     MERC  C class  123        6    52 lakhs
3     MERC  G Wagon  365        4    2 crores
4      BMW    730 i  237        5  1.4 crores
5   SUZUKI  Celerio  127       25   6.5 lakhs
6  HYUNDAI    Verna  300       20    15 lakhs
7  HYUNDAI    Venue  211       18    16 lakhs
8   TOYOTA   Crysta  654       10    32 lakhs

In [ ]:
df4.iloc[ 1:4 ,1: 4 ]

     Model   hp  mileage
1       A4  324        6
2  C class  123        6
3  G Wagon  365        4

In [ ]:
df4.loc[5:7,'Model':'mileage']

     Model   hp  mileage
5  Celerio  127       25
6    Verna  300       20
7    Venue  211       18

In [ ]:
df4.iloc[5:8,1:4]

     Model   hp  mileage
5  Celerio  127       25
6    Verna  300       20
7    Venue  211       18